src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1Прежний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйКанал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемПриходится</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

//Состав групп — регистр УЗ_СоставГрупп (решение В29): кто в группе на дату, отвечает
//РегистрыСведений.УЗ_СоставГрупп (СоставГруппыНаДату, ПричинаНеВГруппе, НеЗаписыватьВУрокГруппы); меняет состав
//только документ «Перевод ученика». Табличная часть карточки «Группы обучения (прежние)» — лишь источник шага
//обновления данных 6.

#Область Остатки

//Блок «по тарифу» карточки ученика: остаток денег по тарифу карточки в организации (В12) и сколько уроков (часов)
//он покрывает по цене тарифа на дату (В8: Документы.УЗ_Урок.ЦенаТарифаНаДату — та же цена, что в уроке и панели;
//было: цена карточки тарифа — у тарифа с историей цен блок молчал). Цены нет или в ней 0 уроков и 0 часов —
//единиц не считаем (было: деление на ноль).
//Структура: Остаток (число), Единиц (число или Неопределено — не считается), ЕдиницаИзмерения («уроков»/«ч»),
//Уроков, Явок (проведено по тарифу).
Функция ОстатокПоТарифу(Ученик, Тариф, Организация, Дата = Неопределено) Экспорт

	Итог = Новый Структура("Остаток, Единиц, ЕдиницаИзмерения, Уроков, Явок", 0, Неопределено, "", 0, 0);
	Если Не ЗначениеЗаполнено(Ученик) Или Не ЗначениеЗаполнено(Тариф) Тогда
		Возврат Итог;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Остатки.СуммаОстаток), 0) КАК Остаток,
	|	ЕСТЬNULL(СУММА(Остатки.КоличествоУроковОстаток), 0) КАК Уроков,
	|	ЕСТЬNULL(СУММА(Остатки.КоличествоЯвокОстаток), 0) КАК Явок
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.Остатки(
	|			,
	|			Клиент = &Ученик
	|				И Тариф = &Тариф
	|				И (&ВсеОрганизации
	|					ИЛИ Организация = &Организация)) КАК Остатки";
	Запрос.УстановитьПараметр("Ученик", Ученик);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	Запрос.УстановитьПараметр("ВсеОрганизации", Организация = Неопределено);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Итог.Остаток = Выборка.Остаток;
	Итог.Уроков = Выборка.Уроков;
	Итог.Явок = Выборка.Явок;
	Если Итог.Остаток <= 0 Тогда
		Возврат Итог;
	КонецЕсли;
	//цена единицы — одна функция с панелью ученика (Документы.УЗ_Урок.ЦенаЕдиницыТарифа: цена на дату, уроки или часы)
	Цена = Документы.УЗ_Урок.ЦенаЕдиницыТарифа(Тариф, ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата));
	Если Цена = Неопределено Или Цена.Цена <= 0 Тогда
		Возврат Итог;
	КонецЕсли;
	Итог.Единиц = Окр(Итог.Остаток / Цена.Цена, 2);
	Итог.ЕдиницаИзмерения = ?(Цена.Единица = "ч.", НСтр("ru = 'ч'"), НСтр("ru = 'уроков'"));
	Возврат Итог;

КонецФункции

#КонецОбласти

#Область ДниРождения

//Дни рождения сегодня и в ближайшие Дней дней (журнал уроков). «Осталось дней» — до ближайшего дня рождения
//(0 — сегодня; 29 февраля в невисокосный год — 1 марта), «Исполнится» — сколько лет исполнится в этот день
//(вычисляется от даты рождения; было: хранимый «Возраст», устаревал), «Кто» — ученик или педагог.
//ТаблицаЗначений: ФизЛицо, Дата, ОсталосьДней, Исполнится, Кто — по «Осталось дней».
Функция ДниРождения(Сегодня, Дней = 10) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФизЛица.Ссылка КАК ФизЛицо,
	|	ФизЛица.ДатаРождения КАК Дата,
	|	ФизЛица.ЭтоПедагог КАК ЭтоПедагог
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	НЕ ФизЛица.ПометкаУдаления
	|	И НЕ ФизЛица.ЭтоГруппа
	|	И НЕ ФизЛица.Выбыл
	|	И ФизЛица.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)";
	Выборка = Запрос.Выполнить().Выбрать();

	Итог = Новый ТаблицаЗначений;
	Итог.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов("СправочникСсылка.УЗ_ФизЛица"));
	Итог.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Итог.Колонки.Добавить("ОсталосьДней", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0)));
	Итог.Колонки.Добавить("Исполнится", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0)));
	Итог.Колонки.Добавить("Кто", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	НачалоСегодня = НачалоДня(Сегодня);
	Пока Выборка.Следующий() Цикл
		Осталось = ДнейДоДняРождения(Выборка.Дата, НачалоСегодня);
		Если Осталось > Дней Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДня = Итог.Добавить();
		СтрокаДня.ФизЛицо = Выборка.ФизЛицо;
		СтрокаДня.Дата = Выборка.Дата;
		СтрокаДня.ОсталосьДней = Осталось;
		СтрокаДня.Исполнится = УЗ_ОбщийКлиентСервер.ВозрастНаДату(Выборка.Дата, НачалоСегодня + Осталось * 86400);
		СтрокаДня.Кто = ?(Выборка.ЭтоПедагог, НСтр("ru = 'педагог'"), НСтр("ru = 'ученик'"));
	КонецЦикла;
	Итог.Сортировать("ОсталосьДней, Дата");
	Возврат Итог;

КонецФункции

//Дней от Сегодня до ближайшего дня рождения (29 февраля в невисокосный год — 1 марта).
Функция ДнейДоДняРождения(ДатаРождения, Сегодня) Экспорт

	Для Смещение = 0 По 1 Цикл
		ГодДня = Год(Сегодня) + Смещение;
		Если Месяц(ДатаРождения) = 2 И День(ДатаРождения) = 29 И День(КонецМесяца(Дата(ГодДня, 2, 1))) = 28 Тогда
			ДеньРождения = Дата(ГодДня, 3, 1);
		Иначе
			ДеньРождения = Дата(ГодДня, Месяц(ДатаРождения), День(ДатаРождения));
		КонецЕсли;
		Если ДеньРождения >= НачалоДня(Сегодня) Тогда
			Возврат (ДеньРождения - НачалоДня(Сегодня)) / 86400;
		КонецЕсли;
	КонецЦикла;
	Возврат 366;

КонецФункции

#КонецОбласти

#КонецОбласти
